Revit 2026 API

# BuiltInFailuresDirectShapeFailures Class

---

Failure definitions related to DirectShapes.

SystemObject Autodesk.Revit.DBBuiltInFailuresDirectShapeFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DirectShapeFailures
```
```vb
Public NotInheritable Class DirectShapeFailures
```
```cpp
public ref class DirectShapeFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DirectShapeFailures = class end
```

The BuiltInFailuresDirectShapeFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateDirectShapeOrTypeDocumentCorruption | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeOrTypeError | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeOrTypeWarning | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeRefsWarning | Cannot create reference objects for a DirectShape. |
|  | CannotCreateDirectShapeTypeRefsWarning | Cannot create reference objects for a DirectShapeType. |

#### Reference

Autodesk.Revit.DB Namespace